/*
𝐐𝟏𝟑: 𝐀𝐧𝐚𝐥𝐲𝐳𝐢𝐧𝐠 𝐌𝐨𝐧𝐭𝐡𝐥𝐲 𝐀𝐯𝐞𝐫𝐚𝐠𝐞 𝐒𝐩𝐞𝐧𝐝𝐢𝐧𝐠 𝐨𝐧 𝐂𝐫𝐞𝐝𝐢𝐭 𝐂𝐚𝐫𝐝𝐬
𝐀𝐭 𝐂𝐚𝐩𝐢𝐭𝐚𝐥 𝐎𝐧𝐞, 𝐨𝐧𝐞 𝐨𝐟 𝐭𝐡𝐞 𝐦𝐚𝐭𝐭𝐞𝐫𝐬 𝐭𝐡𝐚𝐭 𝐢𝐧𝐭𝐞𝐫𝐞𝐬𝐭 𝐭𝐡𝐞 𝐛𝐚𝐧𝐤 𝐢𝐬 
𝐮𝐧𝐝𝐞𝐫𝐬𝐭𝐚𝐧𝐝𝐢𝐧𝐠 𝐭𝐡𝐞𝐢𝐫 𝐜𝐮𝐬𝐭𝐨𝐦𝐞𝐫𝐬' 𝐬𝐩𝐞𝐧𝐝𝐢𝐧𝐠 𝐡𝐚𝐛𝐢𝐭𝐬. 𝐋𝐞𝐭'𝐬 𝐬𝐚𝐲 𝐲𝐨𝐮'𝐫𝐞 
𝐠𝐢𝐯𝐞𝐧 𝐚 𝐝𝐚𝐭𝐚𝐬𝐞𝐭 𝐨𝐟 𝐭𝐫𝐚𝐧𝐬𝐚𝐜𝐭𝐢𝐨𝐧𝐬 𝐦𝐚𝐝𝐞 𝐛𝐲 𝐜𝐫𝐞𝐝𝐢𝐭 𝐜𝐚𝐫𝐝 𝐡𝐨𝐥𝐝𝐞𝐫𝐬. 𝐓𝐡𝐞 𝐝𝐚𝐭𝐚𝐬𝐞𝐭
𝐩𝐫𝐨𝐯𝐢𝐝𝐞𝐬 𝐭𝐡𝐞 𝐮𝐬𝐞𝐫_𝐢𝐝, 𝐭𝐫𝐚𝐧𝐬𝐚𝐜𝐭𝐢𝐨𝐧 𝐚𝐦𝐨𝐮𝐧𝐭, 𝐭𝐫𝐚𝐧𝐬𝐚𝐜𝐭𝐢𝐨𝐧 𝐝𝐚𝐭𝐞, 𝐚𝐧𝐝 𝐭𝐡𝐞 𝐜𝐚𝐫𝐝 𝐭𝐲𝐩𝐞.

𝐓𝐨 𝐚𝐬𝐬𝐢𝐬𝐭 𝐭𝐡𝐞 𝐛𝐚𝐧𝐤 𝐢𝐧 𝐮𝐧𝐝𝐞𝐫𝐬𝐭𝐚𝐧𝐝𝐢𝐧𝐠 𝐭𝐡𝐞𝐢𝐫 𝐜𝐮𝐬𝐭𝐨𝐦𝐞𝐫𝐬' 𝐛𝐞𝐡𝐚𝐯𝐢𝐨𝐫 𝐛𝐞𝐭𝐭𝐞𝐫,
𝐜𝐚𝐧 𝐲𝐨𝐮 𝐰𝐫𝐢𝐭𝐞 𝐚 𝐒𝐐𝐋 𝐪𝐮𝐞𝐫𝐲 𝐭𝐨 𝐜𝐚𝐥𝐜𝐮𝐥𝐚𝐭𝐞 𝐭𝐡𝐞 𝐦𝐨𝐧𝐭𝐡𝐥𝐲 𝐚𝐯𝐞𝐫𝐚𝐠𝐞
𝐭𝐫𝐚𝐧𝐬𝐚𝐜𝐭𝐢𝐨𝐧 𝐚𝐦𝐨𝐮𝐧𝐭𝐬 𝐟𝐨𝐫 𝐞𝐚𝐜𝐡 𝐜𝐚𝐫𝐝 𝐭𝐲𝐩𝐞 𝐟𝐫𝐨𝐦 𝐉𝐚𝐧𝐮𝐚𝐫𝐲 𝟐𝟎𝟐𝟐 𝐭𝐨 𝐃𝐞𝐜𝐞𝐦𝐛𝐞𝐫 𝟐𝟎𝟐𝟐?
*/



SELECT
	FORMAT(transaction_date,'yyyy-MM') as transaction_month,
	card_type,
	AVG(transaction_amount) as avg_transaction_amount
FROM
	Capital_One_Transactions_Data
GROUP BY
	FORMAT(transaction_date,'yyyy-MM'),card_type